In [1]:
import numpy as np
import pandas as pd

# Missing Data

In [2]:
Data = {
    'Alpha' : [1,2,3,np.nan,4],
    'Beta' : [np.nan,9,2,np.nan,3],
    'Gamma' : [3,2,4,3,1],
    'Delta'  : [np.nan,3,1,np.nan,np.nan],
    'Zeta' : [1,3,np.nan,6,2]
}

In [3]:
DF = pd.DataFrame(Data)
DF

   Alpha  Beta  Gamma  Delta  Zeta
0    1.0   NaN      3    NaN   1.0
1    2.0   9.0      2    3.0   3.0
2    3.0   2.0      4    1.0   NaN
3    NaN   NaN      3    NaN   6.0
4    4.0   3.0      1    NaN   2.0

In [4]:
DF.isna()

   Alpha   Beta  Gamma  Delta   Zeta
0  False   True  False   True  False
1  False  False  False  False  False
2  False  False  False  False   True
3   True   True  False   True  False
4  False  False  False   True  False

In [5]:
DF.isna().sum()

Alpha    1
Beta     2
Gamma    0
Delta    3
Zeta     1
dtype: int64

In [6]:
DF.isna().any()

Alpha     True
Beta      True
Gamma    False
Delta     True
Zeta      True
dtype: bool

# Drop function is use to remove the whole row having any Null value, and we can put thress hold also

In [7]:
DF.dropna()

   Alpha  Beta  Gamma  Delta  Zeta
1    2.0   9.0      2    3.0   3.0

In [8]:
DF.dropna(thresh = 3)

   Alpha  Beta  Gamma  Delta  Zeta
0    1.0   NaN      3    NaN   1.0
1    2.0   9.0      2    3.0   3.0
2    3.0   2.0      4    1.0   NaN
4    4.0   3.0      1    NaN   2.0

fillna function is use to fill any value of as a place of Null values, coz 21 is my birthday date so 21

In [9]:
DF.fillna(21)

   Alpha  Beta  Gamma  Delta  Zeta
0    1.0  21.0      3   21.0   1.0
1    2.0   9.0      2    3.0   3.0
2    3.0   2.0      4    1.0  21.0
3   21.0  21.0      3   21.0   6.0
4    4.0   3.0      1   21.0   2.0

if we want different values in differnt rows, so use this

In [10]:
values = {"Alpha":21, "Beta": 9, "Gaama":0, "Delta":7, "Zeta": 18}

DF.fillna(value=values)

   Alpha  Beta  Gamma  Delta  Zeta
0    1.0   9.0      3    7.0   1.0
1    2.0   9.0      2    3.0   3.0
2    3.0   2.0      4    1.0  18.0
3   21.0   9.0      3    7.0   6.0
4    4.0   3.0      1    7.0   2.0

In [11]:
DF

   Alpha  Beta  Gamma  Delta  Zeta
0    1.0   NaN      3    NaN   1.0
1    2.0   9.0      2    3.0   3.0
2    3.0   2.0      4    1.0   NaN
3    NaN   NaN      3    NaN   6.0
4    4.0   3.0      1    NaN   2.0

The Main Data is not changing because it just showing us copy, if we will use inplace = True than it will update the change in main Memory

The best way to fill the value is to fill it with mean

In [12]:
DF.fillna(DF.mean())

   Alpha      Beta  Gamma  Delta  Zeta
0    1.0  4.666667      3    2.0   1.0
1    2.0  9.000000      2    3.0   3.0
2    3.0  2.000000      4    1.0   3.0
3    2.5  4.666667      3    2.0   6.0
4    4.0  3.000000      1    2.0   2.0

# Completed